#pragma once
#include "heading.h"

////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                   Заголовочный файл библиотеки mystr                                   //
//                                        Лабораторной работы №4                                          //
//                                              Вариант №12                                               //
//                                  Разработчик: студент группы 19-ИВТ-3                                  //
//                                         Сапожников Владислав                                           //
////////////////////////////////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////////////////////////////////
//            Объявление методов и конструкторов класса TCharArray (Динамическая строка)                  //
////////////////////////////////////////////////////////////////////////////////////////////////////////////
class TCharArray{ 
 protected:                                              //спецификатор protected для доступа к полям из производного класса
  char *str;                                             //указатель настроку типа char(безразмерный массив)
  unsigned int SIZE;                                     //размер

 public:
  TCharArray();                                          //конструктор по умолчанию
  ~TCharArray();                                          //деструктор

  char& at(int n);                                       //метод at
  char& operator[](int n);                               //перегружденный оператор доступа к элементу массива []
};



////////////////////////////////////////////////////////////////////////////////////////////////////////////
//             Объявление методов и конструкторов класса MyString (Динамическая строка)                   //
////////////////////////////////////////////////////////////////////////////////////////////////////////////
class MyString : public TCharArray{ 
 public:
  MyString();                                            //конструктор по умолчанию

//                                   операции сравнения                                                   //
  bool operator == (MyString &str) const;
  bool operator != (MyString &str) const;
  bool operator <  (MyString &str) const;
  bool operator >  (MyString &str) const;

  MyString operator  + (MyString &str);                 //конкатенация строк

  MyString& operator = (const char* otherStr);          /*перегруженный оператор присваивания строки MyString 
                                                          массива char*/
  MyString& operator = (const MyString& otherStr);      //присваивание MyString строки MyString, для конкатенации

//                          дружественный метод для вывода в стандартный поток                          // 
  friend std::ostream& operator << (std::ostream& os, const MyString& str);
};



////////////////////////////////////////////////////////////////////////////////////////////////////////////
//         Объявление методов и конструкторов класса TCharArray_stat (Статическая строка)                 //
////////////////////////////////////////////////////////////////////////////////////////////////////////////
enum{MaxSIZE = 256};                                          //ограничение на кол-во символов в строке
class TCharArray_stat{ 
 protected:                                                   //спецификатор для доступа к полям из класса наследника   
  char str[MaxSIZE];                                          //массив типа char - статическая строка
  int SIZE;                                                   //размер строки
       
 public:
  TCharArray_stat();                                          //конструктор по умолчанию

//                   пускай дальнеший функциал и не будет использован, но пусть будет                   //  
  char& at(int n);                                       //метод at()
  char& operator[](int n);                               //перегружденный оператор доступа к элементу массива []
};



////////////////////////////////////////////////////////////////////////////////////////////////////////////
//           Объявление методов и конструкторов класса MyString_stat (Статическая строка)                 //
////////////////////////////////////////////////////////////////////////////////////////////////////////////
class MyString_stat : public TCharArray_stat{ 

 public:
  MyString_stat();                                                     //конструктор по умолчанию
                                                                       //описывать деструктор бессмысленно, т.к. все поля статичны

  MyString_stat& operator = (const char* otherStr);                    //перегруженный оператор присваивания
  static std::string alignLinesOfMyStr(MyString_stat &str, int width);  //



//                          дружественный метод для вывода в стандартный поток                          // 
  friend std::ostream& operator << (std::ostream& os, const MyString_stat& str);



//                   пускай дальнеший функциал и не будет использован, но пусть будет                   //  
  bool operator == (MyString_stat &str) const;
  bool operator != (MyString_stat &str) const;
  bool operator <  (MyString_stat &str) const;
  bool operator >  (MyString_stat &str) const;
};



//                                 Функция проверки класса MyString_stat                                // 
void MyString_check(); 